app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES('Tigers', '2010-10-19 14:25:54', '2010-10-19 14:25:54')
---
  def create
    @team = Team.new(params[:team])
    if @team.save

SELECT * FROM "teams" WHERE ("teams"."id" = 3)
---
  def show
    @team = Team.find(params[:id], :include => :players)

SELECT * FROM "teams" WHERE ("teams"."id" = 3)
---
  def edit
    @team = Team.find(params[:id], :include => :players)

SELECT * FROM "teams" WHERE ("teams"."id" = 3)
UPDATE "teams" SET "name" = 'Bears', "updated_at" = '2010-10-19 14:27:28' WHERE "id" = 3
---
  def update
    @team = Team.find(params[:id])

    if @team.update_attributes(params[:team])